package com.example.whatseat

class RecipeDataSource {
    fun getRecipes(): List<Recipe> {
        return listOf(
            Recipe(
                "Лазанья классическая с мясом 1",
                R.drawable.image_recipe,
                "Мясной фарш\n" +
                        "600 г.\n" +
                        "Соус болоньезе\n" +
                        "600 г.\n" +
                        "Сливочное масло\n" +
                        "60 г.\n" +
                        "Пшеничная мука\n" +
                        "2,5 ст.л.\n" +
                        "Оливковое масло\n" +
                        "2 ст.л.\n" +
                        "Молоко\n" +
                        "750 мл\n" +
                        "Готовые сухие листы лазаньи\n" +
                        "10 шт.\n" +
                        "Твердый сыр\n" +
                        "500 г."

            ),
            Recipe(
                "Лазанья классическая с мясом 2",
                R.drawable.image_recipe,
                "Мясной фарш\n" +
                        "600 г.\n" +
                        "Соус болоньезе\n" +
                        "600 г.\n" +
                        "Сливочное масло\n" +
                        "60 г.\n" +
                        "Пшеничная мука\n" +
                        "2,5 ст.л.\n" +
                        "Оливковое масло\n" +
                        "2 ст.л.\n" +
                        "Молоко\n" +
                        "750 мл\n" +
                        "Готовые сухие листы лазаньи\n" +
                        "10 шт.\n" +
                        "Твердый сыр\n" +
                        "500 г."

            ),
            Recipe(
                "Лазанья классическая с мясом 3",
                R.drawable.image_recipe,
                "Мясной фарш\n" +
                        "600 г.\n" +
                        "Соус болоньезе\n" +
                        "600 г.\n" +
                        "Сливочное масло\n" +
                        "60 г.\n" +
                        "Пшеничная мука\n" +
                        "2,5 ст.л.\n" +
                        "Оливковое масло\n" +
                        "2 ст.л.\n" +
                        "Молоко\n" +
                        "750 мл\n" +
                        "Готовые сухие листы лазаньи\n" +
                        "10 шт.\n" +
                        "Твердый сыр\n" +
                        "500 г."

            )
        )
    }
}